### portmy database: profits, stocks tables
### portpg database: consensus, tickers tables
### csv files: consensus-ORD.csv

In [1]:
import pandas as pd
import numpy as np
import os

from datetime import date, timedelta
from sqlalchemy import create_engine
from pandas.tseries.offsets import BDay

engine = create_engine("sqlite:///c:\\ruby\\portmy\\db\\development.sqlite3")
conmy = engine.connect()
engine = create_engine("postgresql+psycopg2://postgres:admin@localhost:5432/portpg_development")
conpg = engine.connect()
engine = create_engine("sqlite:///c:\\ruby\\port_lite\\db\\development.sqlite3")
conlite = engine.connect()
engine = create_engine('mysql+pymysql://root:@localhost:3306/stock')
const = engine.connect()

data_path = "../data/"
csv_path = "\\Users\\User\\iCloudDrive\\"
one_path = "\\Users\\User\\OneDrive\\Documents\\Data\\"
osd_path = "\\Users\\User\\OneDrive\\Documents\\obsidian-git-sync\\Data\\"

# Define a formatting function to format integers with zero decimal places and floats with two decimal places
def format_cell(x):
    if isinstance(x, int):
        return "{:,.0f}".format(x)
    elif isinstance(x, float):
        return "{:.2f}".format(x)
    else:
        return x

#pd.options.display.float_format = '{:.2f}'.format

today = date.today()
today

datetime.date(2023, 9, 2)

In [2]:
# convert the timedelta object to a BusinessDay object
num_business_days = BDay(1)
yesterday = today - num_business_days
print(f'today: {today}')
print(f'yesterday: {yesterday}')

today: 2023-09-02
yesterday: 2023-09-01 00:00:00

In [3]:
# find the beginning of the week for the given yesterday
week_start = yesterday.to_period('W').start_time
week_end = yesterday.to_period('W').end_time
week_start = week_start.date()
week_end = week_end.date()
print(f'week start: {week_start}')
print(f'week end: {week_end}')

week start: 2023-08-28
week end: 2023-09-03

In [4]:
yesterday = yesterday.date()
week_start, yesterday

(datetime.date(2023, 8, 28), datetime.date(2023, 9, 1))

### Restart and Run All Cells

In [5]:
cols = 'quarter price target_price upside buy hold sell yield max_price min_price pe pbv dly_vol beta'.split()
colt = 'name price target_price upside buy hold sell market sector subsector dly_vol beta yield'.split()
colu = 'price target_price upside buy hold sell mrkt yield'.split()

In [6]:
format_dict = {
    'latest_amt_y':'{:,}','previous_amt_y':'{:,}','inc_amt_y':'{:,}',   
    'latest_amt_q':'{:,}','previous_amt_q':'{:,}','inc_amt_q':'{:,}',    
    'q_amt_c':'{:,}','y_amt': '{:,}','inc_amt_py':'{:,}', 
    'q_amt_p': '{:,}','inc_amt_pq':'{:,}', 
    'inc_pct_y': '{:.2f}%','inc_pct_q': '{:.2f}%',
    'inc_pct_py': '{:.2f}%','inc_pct_pq': '{:.2f}%',
    'mean_pct': '{:.2f}%','std_pct': '{:.2f}%','upside': '{:.2f}%', 
    
    'price':'{:.2f}','target_price':'{:.2f}','diff':'{:.2f}',
    'eps_a':'{:.2f}','eps_b':'{:.2f}',                
    'pe':'{:.2f}','pbv':'{:.2f}',
    'yield':'{:.2f}%',
    
    'price':'{:.2f}','max_price':'{:.2f}','min_price':'{:.2f}',   
    'target':'{:.2f}','max':'{:.2f}','min':'{:.2f}',
    'pe':'{:.2f}','pbv':'{:.2f}',
    'paid_up':'{:,.2f}','market_cap':'{:,.2f}',   
    'daily_volume':'{:,.2f}','beta':'{:,.2f}', 
    'dly_vol':'{:,.2f}',    
}

In [7]:
pd.options.display.max_rows = 40
sql = '''
SELECT *
FROM profits
LIMIT 1'''
my_profit = pd.read_sql(sql, conmy)
my_profit.dtypes

id                  int64
name               object
year                int64
quarter             int64
kind                int64
latest_amt_y        int64
previous_amt_y      int64
inc_amt_y           int64
inc_pct_y         float64
latest_amt_q        int64
previous_amt_q      int64
inc_amt_q           int64
inc_pct_q         float64
q_amt_c             int64
y_amt               int64
inc_amt_py          int64
inc_pct_py        float64
q_amt_p             int64
inc_amt_pq          int64
inc_pct_pq        float64
ticker_id           int64
mean_pct          float64
std_pct           float64
dtype: object

In [8]:
sql = '''
SELECT *
FROM stocks
LIMIT 1'''
lite_stock = pd.read_sql(sql, conlite)
lite_stock.dtypes

id                 int64
name              object
max_price        float64
min_price        float64
status            object
buy_target       float64
sell_target      float64
volume           float64
beta             float64
cost             float64
qty                int64
buy_spread         int64
sell_spread        int64
available_qty      int64
bl               float64
sh               float64
reason            object
market            object
dtype: object

In [9]:
sql = '''
SELECT *
FROM tickers
LIMIT 1'''
my_ticker = pd.read_sql(sql, conmy)
my_ticker.dtypes

id             int64
name          object
full_name     object
sector        object
subsector     object
market        object
website       object
created_at    object
updated_at    object
dtype: object

In [10]:
sql = '''
SELECT P.name, market
FROM profits P
JOIN tickers T
ON P.ticker_id = T.id 
ORDER BY P.name'''
my_profits = pd.read_sql(sql, conmy)
my_profits

      name                             market
0   AIMIRT                                SET
1      BBL            SET50 / SETHD / SETTHSI
2      BEM            SET50 / SETTHSI / SETWB
3       BH            SET50 / SETCLMV / SETWB
4       CK         SET100 / SETCLMV / SETTHSI
5      CPN                    SET50 / SETTHSI
6    DELTA                                SET
7     HANA                   SET100 / SETTHSI
8     ICHI                     sSET / SETCLMV
9      III                               sSET
10     JMT                              SET50
11     KTB            SET50 / SETHD / SETTHSI
12       M                              SETWB
13     PSH                            SETTHSI
14   PTTEP  SET50 / SETCLMV / SETHD / SETTHSI
15      QH                     SET100 / SETHD
16   SAPPE                               sSET
17      SC                     sSET / SETTHSI
18    SIRI                      SET / SETTHSI
19     TOA                            SETTHSI
20     TTB            SET50 / SETHD / SETTHSI

### ruby ruby\crt-consensus-new.rb

In [11]:
%pwd

'C:\\Users\\User\\OneDrive\\A7\\Weekly'

In [12]:
os.chdir("C:\\users\\user\\onedrive\\a7")
%pwd

'C:\\users\\user\\onedrive\\a7'

In [13]:
!ruby ruby\\crt-consensus-new.rb

Start at: Saturday, Sep 02 10:34 PM
Name,Target,Max,Min,Buy,Hold,Sell
ACE        3.76   3.76   3.76  1  0  0   1
ADVANC   247.33 265.00 230.00 13  1  0   2
AEONTS   201.88 230.00 180.00  3  5  0   3
AH        46.14  54.10  41.00  8  0  0   4
AIMIRT    14.50  14.50  14.50  1  0  0   5
AJ        10.20  10.20  10.20  1  0  0   6
AMATA     28.42  30.00  25.80 15  1  0   7
ANAN       0.74   0.80   0.62  0  1  0   8
AOT       83.43  92.00  72.00 14  2  0   9
AP        14.40  15.50  12.20 15  1  0  10
ASIAN      8.64   9.50   7.59  2  2  0  11
ASK       33.81  40.75  30.00  4  0  0  12
ASP        3.00   3.00   3.00  0  0  0  13
ASW        9.62  10.30   8.95  2  1  0  14
AWC        5.90   6.80   5.30  3  3  0  15
BA        20.59  22.00  19.50  5  0  0  16
BAM       13.02  16.00  10.00  6  4  0  17
BANPU      9.13  10.50   6.50  2  4  3  18
BAY       36.38  38.00  32.50  3  1  0  19
BBL      193.00 220.00 164.00 18  1  0  20
BCH       20.71  23.00  15.70 10  3  2  21
BCP       42.19  52.50  34.50 10  5  0  22
BCPG      14.43  18.00  11.00  7  1  0  23
BDMS      35.02  37.50  32.00 15  0  0  24
BE8       58.31  74.00  49.00  4  0  0  25
BEAUTY     0.50   0.50   0.50  0  0  0  26
BEC        8.15   9.00   6.00  3  4  1  27
BEM       10.88  12.40   9.50 14  0  0  28
BGC        9.88  10.30   9.45  1  1  0  29
BGRIM     45.18  50.00  32.00 15  2  0  30
BH       277.60 300.00 235.00 12  3  0  31
BJC       42.43  45.00  30.00 13  1  1  32
BLA       36.00  40.00  32.00  2  0  0  33
BLAND      1.10   1.10   1.10  1  0  0  34
BPP       17.70  20.00  15.50  4  2  0  35
BTS        9.03  11.20   7.50  6  3  0  36
BTSGIF     5.12   6.45   4.15  5  1  0  37
CBG       87.09 109.00  60.00  9  4  1  38
CENTEL    53.24  65.00  47.15  7  6  0  39
CHG        3.48   4.00   2.55  5  6  1  40
CK        26.64  30.25  24.00 12  0  0  41
CKP        4.58   6.20   3.16  5  3  1  42
COM7      37.69  41.00  35.50 12  0  0  43
COTTO      2.24   2.24   2.24  0  0  0  44
CPALL     74.25  79.00  65.50 20  0  0  45
CPAXT     38.92  45.00  33.00 10  3  0  46
CPF       22.11  27.20  17.30  8  8  1  47
CPN       81.04  84.00  78.00 12  0  0  48
CPNREIT   11.63  13.50  10.00  4  2  0  49
CRC       49.87  54.00  46.00 11  2  0  50
DCC        2.27   2.55   2.06  0  4  0  51
DELTA     71.59 100.00  52.50  0  1  0  52

ruby//crt-consensus-new.rb:100:in `block in <main>': undefined method `strip!' for nil:NilClass (NoMethodError)
	from ruby//crt-consensus-new.rb:32:in `each'
	from ruby//crt-consensus-new.rb:32:in `<main>'

DIF       14.75  19.00  12.60  3  1  0  53
DOHOME    10.28  12.80   8.00  5  6  0  54
DRT        8.32   8.50   8.05  1  2  0  55
EA        70.59  84.00  46.00  4  4  0  56
EASTW      8.00   8.00   8.00  1  0  0  57
EGCO     171.14 249.00 120.00  3  3  1  58
EPG        8.85  10.30   7.20  4  2  0  59
ESSO       9.63  10.80   8.30  1  1  1  60
FPT       16.50  16.50  16.50  1  0  0  61
FTREIT    12.00  12.00  12.00  1  0  0  62
GFPT      14.11  16.20  12.30  9  5  0  63
GGC       10.73  12.20  10.00  0  0  0  64
GLOBAL    18.33  22.00  17.00  5  7  0  65
GPSC      73.09  80.00  61.00 12  4  0  66
GULF      58.56  68.00  45.00 13  1  0  67
GUNKUL     4.76   6.20   3.80  6  0  0  68
GVREIT     9.90   9.90   9.90  0  0  0  69
HANA      61.03  71.50  47.60  7  4  1  70
HMPRO     16.80  18.50  14.70 14  2  0  71
HTC       45.00  48.00  41.50  3  1  0  72
ICHI      17.83  19.00  15.70  5  1  0  73
III       15.12  18.10  12.00  5  1  0  74
ILM       23.15  24.00  22.10  1  3  0  75
IMH       13.55  13.55  13.55  1  0  0  76
IMPACT    15.60  16.50  14.70  2  0  0  77
INTUCH    85.21 100.00  68.00  5  0  0  78
IP        18.05  20.10  16.00  2  1  0  79
IRPC       2.63   3.00   2.00  4  8  1  80
IVL       37.08  44.00  28.00 13  3  1  81
JASIF      7.13   8.30   6.00  1  5  0  82
JMART     24.00  24.00  24.00  1  0  0  83
JMT       53.75  66.00  46.00  8  0  0  84
KBANK    149.25 168.00 133.00  9  7  0  85
KCE       51.34  61.00  42.00 12  4  0  86
KEX        8.80  10.80   7.50  0  1  0  87
KKP       63.83  78.00  55.00  4  9  2  88
KSL        4.77   5.30   4.20  3  0  0  89
KTB       22.82  25.00  19.40 15  2  0  90
KTC       58.32  75.00  42.00  8  1  2  91
LH        10.05  11.10   8.80  8  4  0  92
LPF       15.00  15.00  15.00  1  0  0  93
LPN        3.66   4.30   3.00  0  2  0  94
M         55.33  61.00  48.50  7  3  0  95
MAJOR     19.63  23.20  17.50  9  1  0  96
MC        15.24  16.45  14.00  8  0  0  97
MCS        8.30   8.30   8.30  0  0  0  98
MEGA      52.00  65.00  47.00  7  0  0  99
MINT      41.85  46.00  38.00 13  0  0 100
MST       10.00  10.00  10.00  0  0  0 101
MTC       37.73  49.00  31.00  4  6  6 102
NER        5.69   6.20   5.30  5  0  0 103
NOBLE      5.31   5.91   4.70  1  1  0 104
ONEE       6.07   6.40   5.55  7  1  0 105
OR        25.60  30.00  21.00 12  3  1 106
ORI       13.37  15.10  12.50 11  0  0 107
OSP       33.00  36.00  29.00  9  3  0 108
PLANB     10.02  11.00   8.32 11  1  0 109
PRM        9.00  11.10   8.00  6  0  0 110
PSH       11.52  13.50   9.10  1  3  5 111
PSL       11.63  12.50  10.30  3  1  0 112
PTG       12.31  18.00  10.50  7  7  0 113
PTT       39.93  47.50  31.00 14  1  1 114
PTTEP    176.22 200.00 161.00 17  6  0 115
PTTGC     42.88  52.00  34.00  4  9  2 116
QH         2.50   2.90   2.00  4  7  0 117
RATCH     44.32  54.50  35.50  7  4  0 118
RBF       12.53  14.50  10.90  6  1  0 119
RCL       18.00  18.00  18.00  0  0  0 120
RJH       32.00  33.00  31.00  0  0  0 121
ROJNA      7.56   8.70   6.70  3  1  0 122
RS        16.03  17.90  14.00  3  2  1 123
SAPPE    105.37 120.00  93.32  8  3  0 124
SAT       21.81  24.00  19.10  6  5  1 125
SAWAD     53.94  64.00  42.00  8  4  2 126
SC         5.07   5.20   4.80  9  0  0 127
SCB      129.72 145.00 106.50 15  1  0 128
SCC      348.00 410.00 300.00  5  8  0 129
SCCC     155.00 182.00 139.00  2  4  0 130
SCGP      46.57  59.00  33.00 14  2  1 131
SINGER     6.00   6.00   6.00  0  0  0 132
SIRI       2.21   2.32   2.00 11  2  0 133
SIS       29.27  30.53  28.00  2  0  0 134
SJWD      18.55  20.70  16.70  4  0  0 135
SKR       16.40  16.40  16.40  1  0  0 136
SMPC      12.10  12.10  12.10  1  0  0 137
SNC        9.90   9.90   9.90  0  0  0 138
SPALI     25.33  27.80  21.70 13  3  0 139
SPCG      15.80  15.80  15.80  0  0  0 140
SPRC      10.71  12.50   9.00 10  4  0 141
SSP       10.28  14.00   8.00  3  1  1 142
STA       16.12  20.90  13.00  2  3  0 143
STANLY   237.43 245.00 216.00  5  1  0 144
STEC      12.61  15.03  10.40  7  4  0 145
STGT       7.50   7.50   7.50  0  0  0 146
SVI        8.60   9.20   8.00  0  0  0 147
SYNEX     12.91  17.86   7.50  4  1  1 148
TASCO     21.41  26.00  18.00  2  5  0 149
TCAP      56.50  63.00  50.00  4  3  0 150
TFFIF      9.55   9.60   9.50  2  0  0 151
TFG        4.35   5.20   3.70  1  3  0 152
THANI      3.71   4.98   2.80  4  1  1 153
THG       49.00  55.00  47.00  0  0  0 154
TIDLOR    28.42  34.25  24.00 13  1  0 155
TISCO    109.59 124.00 102.00 12  5  0 156
TKN       15.00  15.00  15.00  1  0  0 157
TMT        7.40   8.50   6.30  1  0  0 158
TOA       38.60  40.00  35.00  5  0  0 159
TOP       63.42  78.00  52.50 18  2  0 160
TPIPL      2.32   2.44   2.20  1  1  0 161
TPIPP      4.12   4.55   3.80  1  2  0 162
TQM       39.25  45.00  28.00  3  1  0 163
TRUE       8.21   9.40   7.15  8  3  0 164
TTA        7.85   8.70   7.00  1  1  0 165
TTB        1.74   2.00   1.52  8  8  0 166
TTW        8.60   9.20   8.00  0  1  0 167
TU        17.69  40.00  13.00 14  4  0 168

In [14]:
os.chdir("C:\\users\\user\\onedrive\\a7\\Weekly")
%pwd

'C:\\users\\user\\onedrive\\a7\\Weekly'

In [15]:
data_path = "../data/"
file_name   = 'consensus-new.csv'
input_file = data_path + file_name
consensus = pd.read_csv(input_file, sep=',', index_col=None)
consensus = consensus.rename(columns=str.lower)
consensus

       name  target     max     min  buy  hold  sell
0       ACE    3.76    3.76    3.76    1     0     0
1    ADVANC  247.33  265.00  230.00   13     1     0
2    AEONTS  201.88  230.00  180.00    3     5     0
3        AH   46.14   54.10   41.00    8     0     0
4    AIMIRT   14.50   14.50   14.50    1     0     0
..      ...     ...     ...     ...  ...   ...   ...
163    TRUE    8.21    9.40    7.15    8     3     0
164     TTA    7.85    8.70    7.00    1     1     0
165     TTB    1.74    2.00    1.52    8     8     0
166     TTW    8.60    9.20    8.00    0     1     0
167      TU   17.69   40.00   13.00   14     4     0

[168 rows x 7 columns]

In [16]:
consensus.query('buy + hold + sell == 0')

       name  target    max    min  buy  hold  sell
12      ASP    3.00   3.00   3.00    0     0     0
25   BEAUTY    0.50   0.50   0.50    0     0     0
43    COTTO    2.24   2.24   2.24    0     0     0
63      GGC   10.73  12.20  10.00    0     0     0
68   GVREIT    9.90   9.90   9.90    0     0     0
97      MCS    8.30   8.30   8.30    0     0     0
100     MST   10.00  10.00  10.00    0     0     0
119     RCL   18.00  18.00  18.00    0     0     0
120     RJH   32.00  33.00  31.00    0     0     0
131  SINGER    6.00   6.00   6.00    0     0     0
137     SNC    9.90   9.90   9.90    0     0     0
139    SPCG   15.80  15.80  15.80    0     0     0
145    STGT    7.50   7.50   7.50    0     0     0
146     SVI    8.60   9.20   8.00    0     0     0
153     THG   49.00  55.00  47.00    0     0     0

In [17]:
prf_css = pd.merge(my_profits, consensus, on='name', how='inner')
prf_css.shape

(21, 8)

In [18]:
prf_css.buy.value_counts(normalize=True).to_frame().style.format('{:.2%}')

### Profits w/o consensus

In [19]:
df_merge = pd.merge(my_profits, consensus, on='name', how='outer',indicator=True)
prf_wo_css = df_merge['_merge'] == 'left_only'
df_merge[prf_wo_css]

Empty DataFrame
Columns: [name, market, target, max, min, buy, hold, sell, _merge]
Index: []

In [20]:
names = df_merge[prf_wo_css]['name']
names

Series([], Name: name, dtype: object)

In [21]:
in_p = ", ".join(map(lambda name: "'%s'" % name, names))
in_p

''

In [22]:
sqlDel = """
DELETE FROM profits
WHERE name in (%s)"""
sqlDel = sqlDel % in_p
print(sqlDel)

DELETE FROM profits
WHERE name in ()

In [23]:
rp = conmy.execute(sqlDel)
rp.rowcount

0

### Matching check with Buy table in MySql database to filter only records not yet in stocks

In [24]:
sql = """
SELECT name
FROM buy
WHERE active = 1"""
buy_df = pd.read_sql(sql, const)
buy_df.shape

(31, 1)

In [25]:
final_buy = pd.merge(my_profits, buy_df, on='name', how='outer', indicator=True)
final_buy

       name                   market      _merge
0    AIMIRT                      SET        both
1    AIMIRT                      SET        both
2    AIMIRT                      SET        both
3       BBL  SET50 / SETHD / SETTHSI   left_only
4       BEM  SET50 / SETTHSI / SETWB   left_only
..      ...                      ...         ...
45      AWC                      NaN  right_only
46    SYNEX                      NaN  right_only
47      SCC                      NaN  right_only
48      RCL                      NaN  right_only
49  CPNREIT                      NaN  right_only

[50 rows x 3 columns]

In [26]:
final_buy.rename(columns={'_merge':'merge_1'},inplace=True)
final_buy

       name                   market     merge_1
0    AIMIRT                      SET        both
1    AIMIRT                      SET        both
2    AIMIRT                      SET        both
3       BBL  SET50 / SETHD / SETTHSI   left_only
4       BEM  SET50 / SETTHSI / SETWB   left_only
..      ...                      ...         ...
45      AWC                      NaN  right_only
46    SYNEX                      NaN  right_only
47      SCC                      NaN  right_only
48      RCL                      NaN  right_only
49  CPNREIT                      NaN  right_only

[50 rows x 3 columns]

In [27]:
sql = """
SELECT name 
FROM stocks
ORDER BY name"""
lite_stocks = pd.read_sql(sql, conlite)
lite_stocks.shape

(48, 1)

In [28]:
df_merge = pd.merge(lite_stocks, final_buy, on='name', how='outer', indicator=True)
df_merge

      name                   market     merge_1 _merge
0       AH                      NaN  right_only   both
1   AIMIRT                      SET        both   both
2   AIMIRT                      SET        both   both
3   AIMIRT                      SET        both   both
4      ASK                      NaN  right_only   both
..     ...                      ...         ...    ...
45     TMT                      NaN  right_only   both
46     TOA                  SETTHSI   left_only   both
47     TTB  SET50 / SETHD / SETTHSI   left_only   both
48   WHAIR                      NaN  right_only   both
49   WHART                      NaN  right_only   both

[50 rows x 4 columns]

In [29]:
not_in_final_buy = df_merge.loc[
    df_merge['_merge'] == 'left_only']
not_in_final_buy

Empty DataFrame
Columns: [name, market, merge_1, _merge]
Index: []

In [30]:
names = not_in_final_buy['name']
names

Series([], Name: name, dtype: object)

In [31]:
names = not_in_final_buy['name'].values.tolist()
in_p = ", ".join(map(lambda name: "'%s'" % name, names))
in_p

''

In [32]:
sqlDel = """
DELETE FROM stocks
WHERE name IN (%s)"""
sqlDel = sqlDel % in_p
print(sqlDel)
rp = conlite.execute(sqlDel)
rp.rowcount

DELETE FROM stocks
WHERE name IN ()

0

In [33]:
not_in_port = final_buy.loc[
    final_buy['merge_1'] == 'left_only']
not_in_port

     name                             market    merge_1
3     BBL            SET50 / SETHD / SETTHSI  left_only
4     BEM            SET50 / SETTHSI / SETWB  left_only
5      BH            SET50 / SETCLMV / SETWB  left_only
6      CK         SET100 / SETCLMV / SETTHSI  left_only
7     CPN                    SET50 / SETTHSI  left_only
8   DELTA                                SET  left_only
9    HANA                   SET100 / SETTHSI  left_only
10   ICHI                     sSET / SETCLMV  left_only
11    III                               sSET  left_only
13    KTB            SET50 / SETHD / SETTHSI  left_only
14      M                              SETWB  left_only
15    PSH                            SETTHSI  left_only
16  PTTEP  SET50 / SETCLMV / SETHD / SETTHSI  left_only
17     QH                     SET100 / SETHD  left_only
18  SAPPE                               sSET  left_only
19     SC                     sSET / SETTHSI  left_only
20   SIRI                      SET / SETTHSI  left_only
21    TOA                            SETTHSI  left_only
22    TTB            SET50 / SETHD / SETTHSI  left_only

In [34]:
file_name = 'consensus-ORD.csv'
data_file = data_path + file_name
output_file = csv_path + file_name
osd_file = osd_path + file_name
one_file = one_path + file_name

not_in_port.sort_values(['name'],ascending=[True]).to_csv(output_file, index=False)
not_in_port.sort_values(['name'],ascending=[True]).to_csv(data_file, index=False)
not_in_port.sort_values(['name'],ascending=[True]).to_csv(osd_file, index=False)
not_in_port.sort_values(['name'],ascending=[True]).to_csv(one_file, index=False)

### Process to combine profits and in-port records

In [35]:
sql = '''
SELECT P.name, 'O' AS sts
FROM profits P
ORDER BY P.name'''
df_prf = pd.read_sql(sql, conmy)
df_prf

      name sts
0   AIMIRT   O
1      BBL   O
2      BEM   O
3       BH   O
4       CK   O
5      CPN   O
6    DELTA   O
7     HANA   O
8     ICHI   O
9      III   O
10     JMT   O
11     KTB   O
12       M   O
13     PSH   O
14   PTTEP   O
15      QH   O
16   SAPPE   O
17      SC   O
18    SIRI   O
19     TOA   O
20     TTB   O

In [36]:
sql = '''
SELECT name, 'I' AS sts
FROM buy
ORDER BY name'''
df_buy= pd.read_sql(sql, const)
df_buy

       name sts
0        AH   I
1    AIMIRT   I
2    AIMIRT   I
3    AIMIRT   I
4       ASK   I
5       ASP   I
6       AWC   I
7       BCH   I
8   CPNREIT   I
9       DIF   I
10   GVREIT   I
11      IVL   I
12    JASIF   I
13    JMART   I
14      JMT   I
15      KCE   I
16      MCS   I
17      NER   I
18      ORI   I
19      PTG   I
20    PTTGC   I
21      RCL   I
22      SCC   I
23     SENA   I
24   SINGER   I
25      STA   I
26    SYNEX   I
27    TFFIF   I
28      TMT   I
29    WHAIR   I
30    WHART   I

In [37]:
df_ttl = df_buy.append(df_prf)
df_ttl

      name sts
0       AH   I
1   AIMIRT   I
2   AIMIRT   I
3   AIMIRT   I
4      ASK   I
..     ...  ..
16   SAPPE   O
17      SC   O
18    SIRI   O
19     TOA   O
20     TTB   O

[52 rows x 2 columns]

In [38]:
duplicates_in_name = df_ttl[df_ttl['name'].duplicated(keep=False)]

duplicates_in_name

      name sts
1   AIMIRT   I
2   AIMIRT   I
3   AIMIRT   I
14     JMT   I
0   AIMIRT   O
10     JMT   O

In [39]:
df_unique = df_ttl.drop_duplicates(subset='name', keep='first')
df_unique

      name sts
0       AH   I
1   AIMIRT   I
4      ASK   I
5      ASP   I
6      AWC   I
..     ...  ..
16   SAPPE   O
17      SC   O
18    SIRI   O
19     TOA   O
20     TTB   O

[48 rows x 2 columns]

In [40]:
names = df_unique['name'].values.tolist()
in_p = ", ".join(map(lambda name: "'%s'" % name, names))
in_p

"'AH', 'AIMIRT', 'ASK', 'ASP', 'AWC', 'BCH', 'CPNREIT', 'DIF', 'GVREIT', 'IVL', 'JASIF', 'JMART', 'JMT', 'KCE', 'MCS', 'NER', 'ORI', 'PTG', 'PTTGC', 'RCL', 'SCC', 'SENA', 'SINGER', 'STA', 'SYNEX', 'TFFIF', 'TMT', 'WHAIR', 'WHART', 'BBL', 'BEM', 'BH', 'CK', 'CPN', 'DELTA', 'HANA', 'ICHI', 'III', 'KTB', 'M', 'PSH', 'PTTEP', 'QH', 'SAPPE', 'SC', 'SIRI', 'TOA', 'TTB'"

In [41]:
type(in_p)

str

In [42]:
sql = """
SELECT name 
FROM stocks
WHERE name NOT IN (%s)
"""
sql = sql % in_p
excess_stocks = pd.read_sql(sql, conlite)
excess_stocks

Empty DataFrame
Columns: [name]
Index: []

In [43]:
sql = """
SELECT name, status
FROM stocks
WHERE name  IN (%s)
ORDER BY name
"""
sql = sql % in_p
in_port_on_watch = pd.read_sql(sql, conlite)
in_port_on_watch

      name status
0       AH      B
1   AIMIRT      I
2      ASK      I
3      ASP      I
4      AWC      B
..     ...    ...
43     TMT      B
44     TOA      O
45     TTB      O
46   WHAIR      I
47   WHART      B

[48 rows x 2 columns]

In [44]:
in_port_on_watch.query('status == "T"')

Empty DataFrame
Columns: [name, status]
Index: []

In [45]:
sql = """
SELECT name, status FROM stocks ORDER BY name"""
df_stocks = pd.read_sql(sql, conlite)
df_stocks

      name status
0       AH      B
1   AIMIRT      I
2      ASK      I
3      ASP      I
4      AWC      B
..     ...    ...
43     TMT      B
44     TOA      O
45     TTB      O
46   WHAIR      I
47   WHART      B

[48 rows x 2 columns]

In [46]:
type(in_p)

str

In [47]:
names_list = set(names)
names_in_df = set(df_stocks['name'])

missing_names = names_list - names_in_df
missing_names

set()

In [48]:
type(missing_names)

set

In [49]:
# Convert set to desired string format
formatted_str = ', '.join(f"'{item}'" for item in missing_names)
formatted_str

''

In [50]:
# Convert formatted string back to a list
names_list = [name.strip().strip("'") for name in formatted_str.split(",")]
names_list

['']

In [51]:
# Convert list to DataFrame
df = pd.DataFrame(names_list, columns=['name'])
df

  name
0